# coding:utf-8

'''
符号          描述
%s          格式化字符串，通用类型
%d          格式化整型
%f          格式化浮点型
%u          格式化无符号整型
%c          格式化字符
'''
# 只能有一个字符
print('%c' % 1020)
print('%c' % 'a')
# print('%c' % 'ab') # 报错
print('-------------------')
print('%u' % 1)
print('%u' % -1)
print('-------------------')
print('%f' % 1.2)
print('%f' % 3.14)
print('%f' % 3)
print('-------------------')
print('%d' % 10)
print('%d' % -10)
print('%d' % 1.5)
print('-------------------')
print('%s' % '123')
print('%s' % 123)
print('-------------------')
# format 不能格式化%u
print('{0:d} {1:s}'.format(1,'123'))
'''
符号          说明
%o          格式化无符号八进制数
%x          格式化无符号16进制数
%e          科学计数法格式化浮点数
'''
print('-------------------')
print('%o' % 8)
print('-------------------')
print('%x' % 16)
number = int('123ab',16) #int('123ab',16) 后面的参数16表示要生成一个16进制的数
print(number) #74667
print('%x' % number)
print('-------------------')
print('%e' % 12536549)

