# coding:utf-8

'''默认配置'''
# template_floder = 'templates'   -----------模板的默认目录
# render_template() ------------------------(x)html自动转义
# render_template_string()      ------------字符串自动转义
# {% autoescape %}               -----------手动设置是否转义
# 全局函数和辅助对象               - -----------增强模板的功能

'''全局对象'''
# config                   -----------------Flask的配置信息
# request                 ------------------请求对象
# session                        -----------会话对象
# g                       ------------------请求下那个管的全局变量(如:g.user)

'''全局函数'''
# url_for()              -------------------Url解析函数（如：静态文件地址解析、连接跳转地址解析）
# get_flashed_messages()  ------------------会话消息

'''上下文处理器'''
# 在模板的上下文中添加新的内容
# 内容可以是变量，也可以是函数