# coding:utf-8

# 数据类型转换
# 将自身数据类型变成新的数据类型，并拥有新的数据类型的所有功能的过程即为数据类型转换
# a = '1' 无法做数字操作

# 为了方便更好的帮助处理业务，将类型变为更适合业务场景的类型

# 字符串与数字的转换要求
# str -> number : 数字组成的字符串
# number -> str : 无要求

# 字符串与数字之间的转换函数
'''
原始类型        目标类型        函数          举例
整型           字符串         str()          new_str =str(123456)
浮点型         字符串         str()           new_str =str(3.14)
字符串         整型          int()           new_int = int('12')
字符串         浮点型         float()         new_float = float('3.14')


'''




